/*
*Понимание как работает HTML и Сеть необходимо для эффективного использования возможностей Сети
*
* Я создаю файл .html и размещаю их на веб-сервере
* После размещения в веб-сервер, любой браузер может через Интернет отыскать вашу веб-страницу
* Язык html говорит всё необходимое браузеру, для того чтобы отобразить страницу
* При качественной работе страницы хорошо отображаются на экранах разных устройств и хорошо работают для людей с нарушениями органов восприятия
* Важно чтобы люди пользовались устройствами отображающими веб-страницы
*/