/*
*Читая html-страницу браузер интерпретирует все теги, которые окружают основной текст программы
*Тег - это обычное слово или символ в угловых скобках - <h1>
*С помощью тегов браузер распознаёт структуру и значение написанного текста
*Благодаря тегам можно указать какая часть является названием, где начинается новый абзац, что нужно подчеркнуть, и где расположить изображения
*
*Интересные вещи о HTML и CSS:
*В браузер встроены правила о том, как отображать каждый из элементов
*Можно использовать язык CSS задавая правила редактирования с помощью языка стилевого оформления, определяющего шрифт, цвет, размер и многие другие характеристики страницы
*Браузер игнорирует символы табуляции, абзацы и большинство пробелов в документе HTML
*Читабельность кода важна, для этого надо придерживаться определённого стиля написания кода
*Заголовки от h1 до h6 отображаются путём последовательного уменьшения шрифта
*Тег html говорит браузеру, что текстовый документ является html-документом
*Важно содержимое файла и расширение .html
*HTML5 - последняя версия этого языка, которая упрощает способы написания разметки и приносит новую функциональность
*Основа - это текст, любой браузер сможет найти веб-страницу и понять её содержимое
*Комментарии браузер игнорирует - <!-- игнорируемый текст  -->
*
*<html> - говорит браузеру, что это начало HTML-кода
*<head> - начинается название веб-страницы
*<title> - начинается заглавие страницы
*</head> - конец заголовка
*<body> - начинается основная часть страницы
*<h1> - говорит браузеру, что это заглавие
*<img src="drinks.gif"> - добавляет изображение drinks.gif
*<p> - начинается абзац
*<em> - используется курсивный шрифт
*</p> - заканчивается абзац
*<h2> - говорит браузеру, что это подзаголовок
*<p> - начинается новый абзац
*</p> - заканчивается абзац
*</body> - заканчивается основная часть страницы
*</html> - говорит браузеру, что это конец HTML-кода
*/