// Урок 1 - Условные инструкции-----------------------------------------------------------------------------------------

// Инструкция if

/*
* if (Условие) {
* Блок кода, выполняемый однократно, если Условие правдиво
* }
* */

let val = 10

if (val > 5) {
    val += 20
}

console.log(val) // 30

// Пример if с оператором отрицания

const person = {
    age: 20
}

if (!person.name) {
    console.log('Имя не указано')
    // Другие действия в случае, если свойства 'name' у объекта 'person' нету
}

// Урок 2 - Условная инструкция if else---------------------------------------------------------------------------------

// Первый блок кода выполняется если условие истино, иначе выполнится второй блок

let val1 = 10

if (val1 < 5) {
    val1 += 20
} else {
    val1 -= 20
}

console.log(val1) // -10

// Урок 3 - Условная инструкция if else if------------------------------------------------------------------------------

// можно комбинировать несколько условий

const age = 7

if (age > 18) {
    console.log('Is adult')
} else if (age >= 12) {
    console.log('Is teenager')
} else {
    console.log('Is child')
}

// Урок 4 - Использование if в функциях---------------------------------------------------------------------------------

const sumPositiveNumbers = (a, b) => {
    if (typeof a !== 'number' || typeof b !== 'number') {
        return 'One of the arguments is not a number'
    }
    if (a <= 0 || b <= 0) {
        return 'Numbers are not positive'
    }
    return a + b
}
// рекомендуется использовать только if без else

// Урок 5 - Инструкция switch-------------------------------------------------------------------------------------------

/*
* switch (Выражение) {
* case A:
* Действия если Выражение === A
* break
* case B:
* Действия если Выражение === B
* break
* default:
* в других случаях
* */

// Пример:
const month = 2

switch (month) {
    case 12:
        console.log('Декабрь')
        break
    case 1:
        console.log('Январь')
        break
    case 2:
        console.log('Февраль')
        break
    default:
        console.log('Это не зимний месяц')
}
