/*
Аналогично пути к картинкам
*/
/*
Если вы хотите создать ссылку с одной страницы на другую, используйте элемент <a>.

Атрибут href элемента <a> указывает на целевую страницу ссылки.

Содержимое элемента <a> — метка ссылки. Метка — это то, что мы видим на веб-странице. По умолчанию она
подчеркнута. Это говорит о том, что на ней можно щелкнуть кнопкой мыши.

В качестве метки ссылки может быть использован текст или изображение.

Когда вы щелкаете кнопкой мыши на ссылке, браузер загружает веб-страницу, которая указана в значении атрибута href.

Можно ссылаться на файлы в этой же либо в другой папке.

Относительный путь — это ссылка, указывающая на другие страницы вашего сайта относительно веб-страницы, на
которой эта ссылка находится, точно так же как на карте место назначения имеет связь со стартовой точкой.

Используйте символы «..», чтобы сослаться на файл, который находится в родительской папке (по отношению
к папке, где находится файл, с которого вы ссылаетесь).

Символы «..» означают «родительская папка».

Не забывайте разделять части пути символом «/» (прямой слеш).

Если путь к рисунку указан неверно, вы увидите «отсутствующее изображение» на веб-странице.

Не используйте пробелы в именах, когда даете их файлам и папкам вашего сайта.

Хорошо, если вы систематизируете файлы с самого начала создания сайта, тогда вам не придется менять целые группы путей позже, когда сайт начнет
расширяться.

Существует множество способов приведения сайта в порядок. Вам решать, какой подходит именно вам.
*/