/*
сначала оборачиваем текст, который мы хотим сделать ссылкой на другую страницу в элемент <a>
когда в браузере появилась метка для каждой ссылки, добавляем атрибут в открывающий тег, чтобы сказать браузеру на что ссылка указывает
браузер формирует изображение страницы, и сталкиваясь с элементом <a>, он выводит его содержимое как ссылку, на которой можно щелкнуть кнопкой мыши

Используйте элемент <a> для создания гипертекстовыхьссылок на другую страницу.
Содержимое элемента <a> можно активизировать щелчком кнопкой мыши на веб-странице.
Атрибут href указывает браузеру адрес назначения ссылки.

Когда пользователь щелкает кнопкой мыши на ссылке, браузер проверяет атрибут href, чтобы определить страницу, на которую указывает ссылка
*/