/*
* Цель изучения - понять и запомнить, как создавать веб-страницы, используя наилучшие методы и современные стандарты
* Чтобы научиться чему-либо надо это сначала узнать, а потом убедиться, что не забыл
* Добиваться визуализации - изображения запоминаются лучше, а сама визуализация делает предмет изучения более понятным
*
* Необходимо развить навык - умение учиться
* Перед запоминанием материал необходимо сначала понять
* Я отвечаю за работу своего мозга
* Материал, который я изучаю является ключом к моему благополучию
*
* Что я могу сделать, чтобы заставить свой мозг работать ?
* 1. Не торопиться всё прочитать - чем больше пойму, тем меньше нужно запоминать (заставлять свой мозг глубоко вникать в суть проблемы)
* 2. Выполнять упражнения и делать собственные заметки
* 3. Читать часто задаваемые вопросы и не прорускать
* 4. Не читать что-либо другое перед сном
* 5. Пить много воды
* 6. Громко проговаривать всё, что учу
* 7. Слушать свой мозг и давать ему отдых, иначе можно навредить процессу обучения
* 8. Добавлять эмоции к изучению
* 9. Применять прочитанное для проектирования чего-либо нового или переработки старого, чтобы приобрести опыт*
* */