// Урок 1 - Модули------------------------------------------------------------------------------------------------------

// В реальной жизни реальный проект состоит из большого количества модулей и папок, это делается при помощи модулей и папок
// Модули позволяют структурировать код
// Файл дробится на файлы, происходит дублирование блоков кода
// Синтаксис export/import - ключевые слова
// Можно экспортировать или импортировать части кода в другой код

// Урок 3 - Несколько экспортов-----------------------------------------------------------------------------------------

// Надо использовать несколько переменных через запятую в фигурных скобках

// Через синтаксис as можно переименовать названия переменных

// Урок 3 - Правила работы с модулями-----------------------------------------------------------------------------------

// Модули должны быть одноцелевыми, все export инструкции внизу файла
// Все импорт инструкции располагать сверху файла
// По возможности использовать export default

