// Урок 1 - Введение

// JS позволяет стать разработчиком приложений

// В курсе освещены все базовые понятия о JS
// Курс создан для начинающих программистов

// Как проходить курс по JS ?
// 1-Писать код самостоятельно
// 2-Запускать код, модифицировать его и снова запускать, пока на 100% не будет всё понятно, что происходит при запуске
// 3-Возвращаться назад и пересматривать предыдущие части
// 4-Записывать ключевые понятия и объяснения в своей интерпретации
// 5-Постоянная практика с фокусом и полным вниманием

// После этого курса можно изучать библиотеки и фреймворки и прочее для создания приложений

// Принцип 80/20 - применяться будет только около 20% процентами - достаточно знать один способ

// Урок 2 - Выполнение кода

// Использование веб-браузера либо Node.js

// Использование редактора кода - VSCode + расширения

// Практические задачи обязательны, код необходимо прописывать самостоятельно

// Консоль разработчика - можно использовать для написания небольших частей кода

// Интерпретатор кода интерпретирует код и выводит его в консоль



