// Урок 1 - Операторы---------------------------------------------------------------------------------------------------

// Оператор - внутренняя встроенная функция, которая выполняет действие и возвращает значение как и любая другая функция

// Оператор, операнд, унарный и бинарный, инфиксная, префиксная и постфиксная запись

// Оператор - арифметический, сравнения, логический, присваивания

// Текстовые операторы - typeof, instanceof, new, delete

// let a, b - оператор запятая

// a = 10 - оператор присваивания

// Урок 2 - Оператор присваивания---------------------------------------------------------------------------------------

// У данного оператора есть два операнда
// внутренняя функция function =(переменная, выражение) {
// получение результата выражения, поиск переменной по имени, присваивание результата выражения переменной, возврат результата выражения

// операнды - или аргументы, то что слева и справа от оператора находится

// Урок 3 - Унарные и бинарные операторы--------------------------------------------------------------------------------

// Унарные операторы - имеют один аргумент

// a++ +a delete obj.a typeof a new Object()

// Бинарные операторы

// a = 5 a + b a += 5 a === b a && b

// Урок 4 - Форматы записи операторов-----------------------------------------------------------------------------------

// Инфиксная запись - оператор находится между двумя операндами

// Префиксная запись - оператор находится перед операндом

// Постфиксная запись - оператор после операнда a++ myFn()

// Урок 5 - Приоритетность операторов-----------------------------------------------------------------------------------

// Всё помнить не обязательно, есть таблица и её запоминать не нужно a + b * c / d - e

// Не забываем про скобки !!!

// Урок 6 - Логические операторы----------------------------------------------------------------------------------------

// ! - не (всегда возвращает boolean) && - и  || - или (возвращает значение одного из операндов)

// Урок 7 - Ложные значения---------------------------------------------------------------------------------------------

// Если вызвать boolean(value) -> false (это false, 0, '', undefined, null)

// Урок 8 - Практика с typeof оператором--------------------------------------------------------------------------------

// префиксный унарный оператор

const number = 10

console.log(typeof number)
    
// так можно практиковаться и узнавать какие значения у других переменных



